<a href="https://colab.research.google.com/github/redhatrahul/aiwinter1920/blob/master/Copy_of_pandasinfo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df=pd.read_csv('http://54.166.189.131/datasets/info.csv')
#this support url and desktop path as well as

In [0]:
#df
df.head(3)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [0]:
df.head() #by default top 5 rows

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [0]:
#for any specific columns
df['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [0]:
df.iloc[0:3] #any specific range of rows

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [0]:
df.iloc[0:3,0:3]

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0

In [0]:
df.iloc[[3,5],[1,2]].values

array([[3.8e+01, 6.1e+04],
       [3.5e+01, 5.8e+04]])

In [0]:
max(df['Age'])

50.0

In [0]:
min(df['Age'])

27.0

In [0]:
[i for i in dir(pd) if 'read' in i]

['read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table']